#+TITLE: otolithr 開発プロジェクトノート
#+PROPERTY: header-args :exports code :results scalar
#+STARTUP: contents

*** とりあえず使うには
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
  otldata <- purrr::map(dirs2load, load_otolith)
  df      <- purrr::map_dfr(otldata, as.data.frame)
  head(df)
  tail(df)
  print(paste("統合したファイルの数は", length(unique(df$fname)), "個"))
  # write.csv(df, "test.csv", row.names = FALSE)

#+END_SRC

#+RESULTS:
#+begin_example
There were 50 or more warnings (use warnings() to see the first 50)
        type                          fname spcs date key1 key2 sampleno   inc
1 commercial 20150827_Toyama_Nakase_001.hdr <NA> <NA> <NA> <NA>      001 7.606
2 commercial 20150827_Toyama_Nakase_001.hdr <NA> <NA> <NA> <NA>      001 3.202
3 commercial 20150827_Toyama_Nakase_001.hdr <NA> <NA> <NA> <NA>      001 2.102
4 commercial 20150827_Toyama_Nakase_001.hdr <NA> <NA> <NA> <NA>      001 3.501
5 commercial 20150827_Toyama_Nakase_001.hdr <NA> <NA> <NA> <NA>      001 2.302
6 commercial 20150827_Toyama_Nakase_001.hdr <NA> <NA> <NA> <NA>      001 3.406
  radius ninc crs.name  stn
1  7.606    0     <NA> <NA>
2 10.808    0     <NA> <NA>
3 12.910    0     <NA> <NA>
4 16.411    0     <NA> <NA>
5 18.713    0     <NA> <NA>
6 22.119    0     <NA> <NA>
        type      fname spcs date key1 key2 sampleno    inc   radius ninc
29717 survey C1_011.hdr <NA> <NA> <NA> <NA>      011  9.127 1314.698    0
29718 survey C1_011.hdr <NA> <NA> <NA> <NA>      011 14.335 1329.033    0
29719 survey C1_011.hdr <NA> <NA> <NA> <NA>      011  9.326 1338.359    0
29720 survey C1_011.hdr <NA> <NA> <NA> <NA>      011  9.833 1348.192    0
29721 survey C1_011.hdr <NA> <NA> <NA> <NA>      011 11.029 1359.221    0
29722 survey C1_011.hdr <NA> <NA> <NA> <NA>      011  8.521 1367.742    0
      crs.name  stn
29717     <NA> <NA>
29718     <NA> <NA>
29719     <NA> <NA>
29720     <NA> <NA>
29721     <NA> <NA>
29722     <NA> <NA>
[1] "統合したファイルの数は 200 個"
#+end_example

*** ファイルは標本を一意に特定できるように命名せよ
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
df %>% dplyr::filter(!is.na(spcs)) %>% head()
#+END_SRC

#+RESULTS:
#+begin_example
    type                                      fname                    spcs
1 survey Sardinops-melanostictus_YK1508_MT10_01.hdr Sardinops-melanostictus
2 survey Sardinops-melanostictus_YK1508_MT10_01.hdr Sardinops-melanostictus
3 survey Sardinops-melanostictus_YK1508_MT10_01.hdr Sardinops-melanostictus
4 survey Sardinops-melanostictus_YK1508_MT10_01.hdr Sardinops-melanostictus
5 survey Sardinops-melanostictus_YK1508_MT10_01.hdr Sardinops-melanostictus
6 survey Sardinops-melanostictus_YK1508_MT10_01.hdr Sardinops-melanostictus
  date key1 key2 sampleno   inc radius ninc crs.name  stn
1 <NA> <NA> <NA>       01 7.403  7.403    0   YK1508 MT10
2 <NA> <NA> <NA>       01 1.900  9.303    0   YK1508 MT10
3 <NA> <NA> <NA>       01 1.803 11.106    0   YK1508 MT10
4 <NA> <NA> <NA>       01 1.800 12.906    0   YK1508 MT10
5 <NA> <NA> <NA>       01 2.602 15.508    0   YK1508 MT10
6 <NA> <NA> <NA>       01 2.802 18.310    0   YK1508 MT10
#+end_example

*** .hdr ファイルがある全ディレクトリのリストを作成する
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
  dirs_org  <- get_path(path)
  head(dirs_org)
  tail(dirs_org)
  length(dirs_org)
#+END_SRC

#+RESULTS[caea1325df86bc364fb11547bcc08ea5a1f4c877]:
#+begin_example
[1] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_001.hdr"
[2] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_002.hdr"
[3] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_003.hdr"
[4] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_004.hdr"
[5] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_005.hdr"
[6] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_006.hdr"
[1] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_004.hdr"
[2] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_005.hdr"
[3] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_007.hdr"
[4] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_009.hdr"
[5] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_010.hdr"
[6] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_011.hdr"
[1] 209
#+end_example
*** 上記リストのうち，実際に解析に使う個体だけを抽出したリストを作成する
本パッケージでは，data/ 以下に入っている.hdrファイル以外は無視する
理由: 日輪が不明瞭だったりして解析できなかった個体は，統合データを汚染するため．
解析に含めないデータは data/ 内に残しておかず，cannot/ などに格納するようにする．
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
  dirs2load <- dirs_org %>% get_dir2load()
  head(dirs2load)
  tail(dirs2load)
  print(paste("データ統合から除外された個体は", length(dirs_org) - length(dirs2load), "個体．"))
#+END_SRC

#+RESULTS[fb279dd039435937cf9a2fd733231c60575912ab]:
#+begin_example
[1] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_001.hdr"
[2] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_002.hdr"
[3] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_003.hdr"
[4] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_004.hdr"
[5] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_005.hdr"
[6] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/commercial/data/20150827_Toyama_Nakase_006.hdr"
[1] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_004.hdr"
[2] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_005.hdr"
[3] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_007.hdr"
[4] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_009.hdr"
[5] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_010.hdr"
[6] "/Users/ahayashi/Documents/GitHub/otolith/ratocB/Sardinops_melanostictus/survey/YK1611/data/C1_011.hdr"
[1] "データ統合から除外された個体は 9 個体．"
#+end_example
*** フルパスをファイル名に変換する
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
  fnames    <- dirs2load %>%
    fullpath2fname()
  head(fnames)
  tail(fnames)
#+END_SRC

#+RESULTS[fe5422fe888fa3db6b9f764e6d16804f5299e3ab]:
: [1] "20150827_Toyama_Nakase_001.hdr" "20150827_Toyama_Nakase_002.hdr"
: [3] "20150827_Toyama_Nakase_003.hdr" "20150827_Toyama_Nakase_004.hdr"
: [5] "20150827_Toyama_Nakase_005.hdr" "20150827_Toyama_Nakase_006.hdr"
: [1] "C1_004.hdr" "C1_005.hdr" "C1_007.hdr" "C1_009.hdr" "C1_010.hdr"
: [6] "C1_011.hdr"
**** 属性の取得
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
  types     <- purrr::map(dirs2load, detect_type) %>% unlist()
  head(types)
  tail(types)
#+END_SRC

#+RESULTS[ac12538cc55d321689a741274eafc4d9c7939618]:
: [1] "commercial" "commercial" "commercial" "commercial" "commercial"
: [6] "commercial"
: [1] "survey" "survey" "survey" "survey" "survey" "survey"
**** ファイル名に属性を付与
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
  fnames_with_type <- purrr::map2(fnames, types, set_type)
  head(fnames_with_type, 2)
  tail(fnames_with_type, 2)
#+END_SRC

#+RESULTS[8b541d5a40959b9fb57eaacc72ae1189c746c5f3]:
#+begin_example
[[1]]
[1] "20150827_Toyama_Nakase_001.hdr"
attr(,"class")
[1] "commercial"

[[2]]
[1] "20150827_Toyama_Nakase_002.hdr"
attr(,"class")
[1] "commercial"
[[1]]
[1] "C1_010.hdr"
attr(,"class")
[1] "survey"

[[2]]
[1] "C1_011.hdr"
attr(,"class")
[1] "survey"
#+end_example

**** 属性に応じてファイル名から情報を取得
#+BEGIN_SRC R :results output :exports both :session *R:tidyNAS*
  info      <- purrr::map(fnames_with_type, get_info)
  str(info[[1]])
  str(info[[100]])
  str(info[[200]])
#+END_SRC

#+RESULTS[df719b506d94a96544097afef7f57cb76cac066c]:
#+begin_example
List of 7
 $ type    : chr "commercial"
 $ fname   : chr "20150827_Toyama_Nakase_001.hdr"
 $ spcs    : chr NA
 $ date    : chr NA
 $ key1    : chr NA
 $ key2    : chr NA
 $ sampleno: chr "001"
List of 6
 $ type    : chr "survey"
 $ fname   : chr "Sardinops-melanostictus_YK1508_MT10_01.hdr"
 $ spcs    : chr "Sardinops-melanostictus"
 $ crs.name: chr "YK1508"
 $ stn     : chr "MT10"
 $ sampleno: chr "01"
List of 6
 $ type    : chr "survey"
 $ fname   : chr "C1_011.hdr"
 $ spcs    : chr NA
 $ crs.name: chr NA
 $ stn     : chr NA
 $ sampleno: chr "011"
#+end_example

** 本バッケージ内部で使用するパッケージ
#+BEGIN_SRC R :results silent
  usethis::use_package("magrittr", "Imports")
  usethis::use_package("ggplot2", "Imports")
  usethis::use_package("tibble", "Imports")
  usethis::use_testthat()
#+END_SRC

#+BEGIN_SRC sh :exports results
  cat otolithr/DESCRIPTION
#+END_SRC

#+RESULTS[26e6d91ffe9c3ff5d95f888fb0006e9154a02abb]:
#+begin_example
Package: otolithr
Title: What the Package Does (one line, title case)
Version: 0.0.0.9000
Authors@R: person("First", "Last", email = "first.last@example.com", role = c("aut", "cre"))
Description: What the package does (one paragraph).
Depends: R (>= 3.5.1)
License: What license is it under?
Encoding: UTF-8
LazyData: true
RoxygenNote: 6.1.1
Suggests: 
    testthat
Imports: 
    magrittr,
    ggplot2,
    tibble
#+end_example

** リロード & 自動テスト
#+BEGIN_SRC R :results output
  setwd("otolithr")
  devtools::load_all()
  system("R CMD INSTALL --preclean --no-multiarch --with-keep.source .")
  devtools::test()
  devtools::document(roclets=c('rd', 'collate', 'namespace'))
#+END_SRC

#+RESULTS[62d4820a9216b105c72787e032f80205ff1ada32]:
: No man pages found in package  ‘otolithr’ 
